#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* scheduler
#include "CpuTask.h"
#include "CpuWorkerThread.h"
#include "CpuTaskScheduler.h"

//* engine
#include <Runtime/Foundation.hpp>

////////////////////////////////////////////////////////////////////////////////////////////
// Sxavenger Engine namespace
////////////////////////////////////////////////////////////////////////////////////////////
SXAVENGER_ENGINE_NAMESPACE_BEGIN_(Scheduler)

////////////////////////////////////////////////////////////////////////////////////////////
// CpuScheduler class
////////////////////////////////////////////////////////////////////////////////////////////
class CpuScheduler final {
public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	void Init();

	void Shutdown();

	TaskHandle PushTask(const std::shared_ptr<CpuTask>& task);

private:

	//=========================================================================================
	// private variables
	//=========================================================================================

	//* queue thread *//

	std::array<CpuWorkerThread, 2> threads_; //!< TODO: Configurationでスレッド数を変更できるようにする.

	CpuTaskScheduler scheduler_;

	//=========================================================================================
	// private methods
	//=========================================================================================

	std::shared_ptr<CpuTask> GetTaskProc(const CpuWorkerThread& thread);

};

SXAVENGER_ENGINE_NAMESPACE_END
