#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* scheduler
#include "CpuTask.h"

//* engine
#include <Runtime/Foundation.hpp>

//* c++
#include <functional>
#include <mutex>
#include <condition_variable>
#include <queue>

////////////////////////////////////////////////////////////////////////////////////////////
// Sxavenger Engine namespace
////////////////////////////////////////////////////////////////////////////////////////////
SXAVENGER_ENGINE_NAMESPACE_BEGIN_(Scheduler)

////////////////////////////////////////////////////////////////////////////////////////////
// CpuTaskScheduler class
////////////////////////////////////////////////////////////////////////////////////////////
class CpuTaskScheduler final {
public:

	////////////////////////////////////////////////////////////////////////////////////////////
	// Priority structure
	////////////////////////////////////////////////////////////////////////////////////////////
	struct Priority {
	public:

		//=========================================================================================
		// public methods
		//=========================================================================================

		//* operator [comparison] <std::shared_ptr<CpuTask>> *//

		bool operator()(const std::shared_ptr<CpuTask>& lhs, const std::shared_ptr<CpuTask>& rhs) const {
			return lhs->GetPriority() < rhs->GetPriority(); //!< 優先度が高い方を優先する.
		}

	};

	////////////////////////////////////////////////////////////////////////////////////////////
	// Condition structure
	////////////////////////////////////////////////////////////////////////////////////////////
	struct Condition {
	public:

		//-----------------------------------------------------------------------------------------
		// using
		//-----------------------------------------------------------------------------------------
		using Predicate = std::function<bool()>; //!< 条件変数で待機する際の条件判定関数.

	public:

		//=========================================================================================
		// public methods
		//=========================================================================================

		void Notify();

		void NotifyAll();

		void Wait(const Predicate& predicate);

		//=========================================================================================
		// public variables
		//=========================================================================================

		std::mutex mutex;
		std::condition_variable condition;

	};

	//-----------------------------------------------------------------------------------------
	// using
	//-----------------------------------------------------------------------------------------
	using Queue = std::priority_queue<std::shared_ptr<CpuTask>, std::vector<std::shared_ptr<CpuTask>>, Priority>;

public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	//* queue option *//

	TaskHandle Push(const std::shared_ptr<CpuTask>& task);

	std::shared_ptr<CpuTask> Pop();

	bool HasTask() const;

	//* condition option *//

	void Notify() { condition_.Notify(); }

	void NotifyAll() { condition_.NotifyAll(); }

	void Wait(const Condition::Predicate& predicate) { condition_.Wait(predicate); }

private:

	//=========================================================================================
	// private variables
	//=========================================================================================

	Queue queue_;
	Condition condition_;

};

SXAVENGER_ENGINE_NAMESPACE_END
