#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* lib
#include "../Lib/Packing.hlsli"

////////////////////////////////////////////////////////////////////////////////////////////
// PackedNormal structure
////////////////////////////////////////////////////////////////////////////////////////////
struct PackedNormal {

	//=========================================================================================
	// public variables
	//=========================================================================================
	
	uint32_t packed;
	
	//=========================================================================================
	// public methods
	//=========================================================================================

	//! @brief float32_t3値として展開する.
	float32_t3 Unpack3() {
		return float32_t3(
			Packing::DecodeSnorm8(packed >> 0),
			Packing::DecodeSnorm8(packed >> 8),
			Packing::DecodeSnorm8(packed >> 16)
		);
	}

	//! @brief float32_t4値として展開する.
	float32_t4 Unpack4() {
		return float32_t4(
			Packing::DecodeSnorm8(packed >> 0),
			Packing::DecodeSnorm8(packed >> 8),
			Packing::DecodeSnorm8(packed >> 16),
			Packing::DecodeSnorm8(packed >> 24)
		);
	}
	
};