#pragma once

//-----------------------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------------------
//* graphics
#include "../GraphicsUtil.h"

//* engine
#include <Runtime/Foundation.hpp>

////////////////////////////////////////////////////////////////////////////////////////////
// Sxavenger Engine namespace
////////////////////////////////////////////////////////////////////////////////////////////
SXAVENGER_ENGINE_NAMESPACE_BEGIN_(Graphics)

////////////////////////////////////////////////////////////////////////////////////////////
// DebugReporter class
////////////////////////////////////////////////////////////////////////////////////////////
class DebugReporter final {
public:

	//=========================================================================================
	// public methods
	//=========================================================================================

	//* constructor / destructor *//

	DebugReporter() noexcept = default;
	~DebugReporter() noexcept { DebugReporter::ReportLiveObjects(); }
	//!< デストラクタでLiveObjectsをレポートすることで、オブジェクトリークの確認ができるようにする

private:

	//=========================================================================================
	// private methods
	//=========================================================================================

	//* report option *//

	static void ReportLiveObjects();

};

SXAVENGER_ENGINE_NAMESPACE_END
